Revit 2027 API
BuiltInFailures.SelectionFailures Class
 Failures about Selections.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SelectionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SelectionFailures
Public NotInheritable Class SelectionFailures
public ref class SelectionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SelectionFailures = class end
The BuiltInFailures.SelectionFailures type exposes the following members.
Properties
Name | Description
NoElementSelected |  No element selected.
NoValidElementSelected |  No valid element selected.
Top
See Also
Reference
Autodesk.Revit.DB Namespace